
basic method
============

> daily()
<rrule[daily / 1900-01-01 / 2100-01-01]>

> yearly()
<rrule[yearly / 1900-01-01 / 2100-01-01]>


until is overriden by recur_for_count()
=======================================

> recur_for_count(daily(), 5)
<rrule[daily / 1900-01-01 / ???]>
- count: 5


can add multiple conditions
===========================

> recur_on_interval(recur_for_count(yearly(), 5), 2)
<rrule[yearly / 1900-01-01 / ???]>
- count: 5
- interval: 2


can use multiple ymonths
========================

> recur_on_ymonth(daily(), c("Feb", "Mar"))
<rrule[daily / 1900-01-01 / 2100-01-01]>
- ymonth: Feb, Mar


can use multiple yweeks
=======================

> recur_on_yweek(daily(), c(5, 9, 12))
<rrule[daily / 1900-01-01 / 2100-01-01]>
- yweek: 5, 9, 12


can use multiple ydays
======================

> recur_on_yday(daily(), c(5, 9, 12))
<rrule[daily / 1900-01-01 / 2100-01-01]>
- yday: 5, 9, 12


can use multiple mdays
======================

> recur_on_mday(daily(), c(5, 9, 12))
<rrule[daily / 1900-01-01 / 2100-01-01]>
- mday: 5, 9, 12


can use wday variations
=======================

> recur_on_wday(daily(), c("Mon", "Thu"), nth = c(1, 2))
<rrule[daily / 1900-01-01 / 2100-01-01]>
- wday: Mon[1, 2], Thu[1, 2]

> recur_on_wday(recur_on_wday(daily(), "Mon", nth = c(1, 2)), "Thu", nth = c(4, 5))
<rrule[daily / 1900-01-01 / 2100-01-01]>
- wday: Mon[1, 2], Thu[4, 5]

> recur_on_wday(yearly(), "Mon", nth = c(1, 2, 10, 13, 15, 16))
<rrule[yearly / 1900-01-01 / 2100-01-01]>
- wday: Mon[1, 2, 10, 13, 15, ...]


can use multiple positions
==========================

> recur_on_position(weekly(), c(-1, 2, 3, -2))
<rrule[weekly / 1900-01-01 / 2100-01-01]>
- position: -2, -1, 2, 3

> recur_on_position(yearly(), c(-1, 2, 3, -2, 10, 12, 13))
<rrule[yearly / 1900-01-01 / 2100-01-01]>
- position: -2, -1, 2, 3, 10, ...


can change offset
=================

> recur_on_easter(weekly(), offset = -1)
<rrule[weekly / 1900-01-01 / 2100-01-01]>
- easter: offset = -1


each recur_ condition works
===========================

> recur_for_count(daily(), 5)
<rrule[daily / 1900-01-01 / ???]>
- count: 5

> recur_on_interval(daily(), 5)
<rrule[daily / 1900-01-01 / 2100-01-01]>
- interval: 5

> recur_with_week_start(daily(), "Tuesday")
<rrule[daily / 1900-01-01 / 2100-01-01]>
- week start: Tue

> recur_on_ymonth(daily(), "Feb")
<rrule[daily / 1900-01-01 / 2100-01-01]>
- ymonth: Feb

> recur_on_yweek(daily(), 5)
<rrule[daily / 1900-01-01 / 2100-01-01]>
- yweek: 5

> recur_on_yday(daily(), 5)
<rrule[daily / 1900-01-01 / 2100-01-01]>
- yday: 5

> recur_on_mday(daily(), 5)
<rrule[daily / 1900-01-01 / 2100-01-01]>
- mday: 5

> recur_on_wday(daily(), "Wed")
<rrule[daily / 1900-01-01 / 2100-01-01]>
- wday: Wed

> recur_on_position(weekly(), 5)
<rrule[weekly / 1900-01-01 / 2100-01-01]>
- position: 5

> recur_on_easter(weekly())
<rrule[weekly / 1900-01-01 / 2100-01-01]>
- easter: offset = 0

