
basic method
============

> calendar()
<calendar[1970-01-01 / 2040-01-01]>

> calendar("USA")
<calendar[USA / 1970-01-01 / 2040-01-01]>


can add holidays
================

> add_hldy(calendar(), hldy_christmas())
<calendar[1970-01-01 / 2040-01-01]>
- Christmas

> add_hldy(add_hldy(calendar(), hldy_christmas()), hldy_martin_luther_king_jr_day())
<calendar[1970-01-01 / 2040-01-01]>
- Christmas
- Martin Luther King Jr. Day

